/****************************************************************** 
 * com_format.h
 *
 *	自定义通讯格式：
 *
 *	1、小端模式！！！
 *
 *	2、以数据包为单位
 *
 *	3、一个包分包头/包身
 *		包头：8字节；
 *			1	ID号（0为服务器，其他为终端）
 *			2	包类型
 *			3~4 包长度：short int，包括包头8字节
 *			5~8 xx代号（如，控制代号）：32位int
 *		
 *			包类型：
 *				控制类：0xfe(-2)，仅服务器到终端，包序号暂时置0
 *				数据类：0xfc(-3)，仅终端到服务器，多包发送时填好包序号
 *				回应包：0xfb(-4)，终端回应某些控制类指令，包序号暂时置0
 *				请求包：0xfa(-5)，终端请求某些信息，包序号暂时置0
 *
 *	4、各种包的结构
 *		基本结构：
 *			包头 + 内容
 *
 *		除“数据包”外，其他包的“xx内容”暂限定4个字节（int）
 *
 *	5、因为硬件模块的限制，一个包最大2048字节！！！
 *
 ******************************************************************/

#ifndef _MY_COM_FMT_H_
#define _MY_COM_FMT_H_


/****************************************************************** 
 *                                                                *
 *                           数据结构                             *
 *                                                                *
 ******************************************************************/

/**************************************************
 *                    包头                        *
 **************************************************/
typedef struct tag_mypackhead
{
	char	ID;
	char	type;
	short	size;
	int		code;
}com_pack_head;

/**************************************************
 *                     包                         *
 **************************************************/
typedef struct tag_mypack{
	com_pack_head			head;
	union tag_packdata
	{
		char			   *data_p;
		int					data32;
	}
							packdata;

}com_pack;



/****************************************************************** 
 *                                                                *
 *                          定义各种代号                          *
 *                                                                *
 ******************************************************************/

/* 最大字节数 */
#define MAX_PACKAGE_SIZE			2048
/* 最小字节数 */
#define LEAST_PACKAGE_SIZE			12


/* 服务器的ID */
#define ID_SERVER					0


/**************************************************
 *                   包类型                       *
 **************************************************/
#define PACK_TYPE_CTRL				-2
#define PACK_TYPE_DATA				-3
#define PACK_TYPE_ACT				-4
#define PACK_TYPE_REQ				-5


/**************************************************
 *                   控制包                       *
 **************************************************/

                /* “控制代号” */
/* LED control */
	/* 下面2个的“控制内容”为，LED灯的序号 */
#define CTRL_TYPE_LED_OFF			0
#define CTRL_TYPE_LED_ON			1
	/* 下面3个的“控制内容”，  置0 */
#define CTRL_TYPE_LED_OFF_ALL		2
#define CTRL_TYPE_LED_ON_ALL		3
#define CTRL_TYPE_GET_LED_STATUS	4


/**************************************************
 *                   回应包                       *
 **************************************************/

                /* “回应代号” */
/* LED control */
	/* 下面1个的“回应内容”为，各个LED的开关情况 */
#define ACK_TYPE_LEDS				5


/**************************************************
 *                   数据包                       *
 **************************************************/

/* 多包发送的“结束包”标志 */
#define PACK_END_PACK				-1


/**************************************************
 *                   请求包                       *
 **************************************************/
/*
 * 请求包的内容待定。。。
 * */



/******************************************************************
 *                                                                *
 *                            错误码                              *
 *                                                                *
 ******************************************************************/

#define ERR_COM_NOTHING				0
#define	ERR_COM_NO_SUCH_COMMAND		-1
#define ERR_COM_BROKEN_PACKAGE		-2


#endif


